import fs from "fs";
import * as coords from "./data/coords.json" assert { type: "json" };
import * as metro from "./data/stations.json" assert { type: "json" };

const coordsDefault = coords.default[0]; // line with stations and it's coordinats
const stations = metro.default[0].stations; // list of all stations itself with lined
const lines = metro.default[0].lines; // list of lines with all stations and transfer stations 
const links = metro.default[0].links; // all links belween all stations with time + time for transfer !!!!!
const transfers = metro.default[0].transfers;
const labels = metro.default[0].labels;

const weightTime = [];

const getWeightTime = (i, j) => {
    for (let link in links) {
        if (links.hasOwnProperty(link)) {
            if (
                links[link].fromStationId == i && links[link].toStationId == j ||
                links[link].fromStationId == j && links[link].toStationId == i
            ) 
            return links[link].weightTime + links[link].weightTransfer;
        }
    }
    return 0;
}

const main = () => {
    const string = `["Бульвар Рокоссовского","Черкизовская","Преображенская площадь","Сокольники","Красносельская","Комсомольская","Красные ворота","Чистые пруды","Лубянка","Охотный ряд","Библиотека имени Ленина","Кропоткинская","Парк культуры","Фрунзенская","Спортивная","Воробьёвы горы","Университет","Проспект Вернадского","Юго-Западная","Речной вокзал","Водный стадион","Войковская","Сокол","Аэропорт","Динамо","Белорусская","Маяковская","Тверская","Театральная","Новокузнецкая","Павелецкая","Автозаводская","Коломенская","Каширская","Кантемировская","Царицыно","Орехово","Домодедовская","Красногвардейская","Щёлковская","Первомайская","Измайловская","Партизанская","Семёновская","Электрозаводская","Бауманская","Курская","Площадь Революции","Арбатская","Смоленская","Киевская","Парк Победы","Славянский бульвар","Кунцевская","Молодёжная","Крылатское","Строгино","Кунцевская","Пионерская","Филёвский парк","Багратионовская","Фили","Кутузовская","Студенческая","Киевская","Смоленская","Арбатская","Александровский сад","Выставочная","Международная","Парк культуры","Октябрьская","Добрынинская","Павелецкая","Таганская","Курская","Комсомольская","Проспект Мира","Новослободская","Белорусская","Краснопресненская","Киевская","Медведково","Бабушкинская","Свиблово","Ботанический сад","ВДНХ","Алексеевская","Рижская","Проспект Мира","Сухаревская","Тургеневская","Китай-город","Третьяковская","Октябрьская","Шаболовская","Ленинский проспект","Академическая","Профсоюзная","Новые Черёмушки","Калужская","Беляево","Коньково","Теплый Стан","Ясенево","Новоясеневская","Планерная","Сходненская","Тушинская","Щукинская","Октябрьское поле","Полежаевская","Беговая","Улица 1905 года","Баррикадная","Пушкинская","Кузнецкий мост","Китай-город","Таганская","Пролетарская","Волгоградский проспект","Текстильщики","Кузьминки","Рязанский проспект","Выхино","Новогиреево","Перово","Шоссе Энтузиастов","Авиамоторная","Площадь Ильича","Марксистская","Третьяковская","Алтуфьево","Бибирево","Отрадное","Владыкино","Петровско-Разумовская","Тимирязевская","Дмитровская","Савёловская","Менделеевская","Цветной бульвар","Чеховская","Боровицкая","Полянка","Серпуховская","Тульская","Нагатинская","Нагорная","Нахимовский проспект","Севастопольская","Чертановская","Южная","Пражская","Улица Академика Янгеля","Аннино","Бульвар Дмитрия Донского","Трубная","Сретенский бульвар","Чкаловская","Римская","Крестьянская застава","Дубровка","Кожуховская","Печатники","Волжская","Люблино","Братиславская","Марьино","Каширская","Варшавская","Каховская","Улица Старокачаловская","Улица Скобелевская","Бульвар Адмирала Ушакова","Улица Горчакова","Бунинская Аллея","Мякинино","Волоколамская","Митино","Марьина Роща","Достоевская","Борисово","Шипиловская","Зябликово","Новокосино","Алма-Атинская","Пятницкое шоссе","Лермонтовский проспект","Жулебино","Битцевский парк","Лесопарковая","Деловой центр","Парк Победы","Спартак"]`

    string.replace(new RegExp('[', 'g'), '{');
    console.log(string);
    
    fs.writeFile('file.json', JSON.stringify(string), (error) => {
        if (error) throw error;
        console.log('Данные успешно записаны в файл');
    });
}

main();

/*
'195': {
    name: 'Спартак',
    lineId: 7,
    linkIds: [ 145, 146 ],
    labelId: 195,
    isTransferStation: false
  }
'227': {
    type: 'link',
    fromStationId: 189,
    toStationId: 190,
    weightTime: 170,
    weightTransfer: 0
  }
*/

